BOT_TOKEN = "8415352290:AAF6n3WjsTfpsKt4bxIZJOeYZrUHJiZCK_U"  # توکنی که از @BotFather گرفتید
ADMIN_ID = 8332027793  # آیدی عددی شما (با ربات @userinfobot بگیرید)
CHANNEL_USERNAME = "@https://t.me/+uFzSSgrsAxkyMjNl"  # یوزرنیم کانال اجباری

# متن‌های دو زبانه
TEXTS = {
    'fa': {
        'welcome': 'به افغان چت خوش آمدید!',
        'join_channel': 'لطفا اول در کانال ما عضو شوید:',
        'check_membership': 'بررسی عضویت',
        'main_menu': 'منوی اصلی',
        'find_partner': '👤 پیدا کردن همصحبت',
        'wallet': '💵 کیف پول من',
        'invite': '👥 دعوت دوستان'
    },
    'ps': {
        'welcome': 'په افغان چت کې ښه راغلاست!',
        'join_channel': 'لږ مهرباني وکړئ په لومړی سر کې زموږ په چینل کې شامل شی:',
        'check_membership': 'د غړیتوب چک',
        'main_menu': 'اصلی مینو',
        'find_partner': '👤 ملګری پیدا کول',
        'wallet': '💵 زما پورسه',
        'invite': '👥 ملګري بلل'
    }
}
